class RoadPaperIconLoader {

  static const bigRoadCharacterList = <String>[
    "骝","锈","绣","秀","留","裤","窟","齁","刘","库","鎏","琉","流","旒","继","疁","柳","果",
    "裹","过","溜","节","界","接","瘤","母","体","木","硫","围","喂","未","陆","茨","慈","次",
    "遛","紫","兹","自","馏","哒","嗒","大","瑠","血","邪","写","绺","客","渴","刻","锍","葛",
    "格","革","镏","即","级","基","旈","活","奤","祸","鲅","蔻","硁","徎","蕖","刳","鸲","秸",
    "钚","湫","莒","圪","桀","莙","洸","窖","钯","猓","硌","趏","俐","嗟","墂","桦","揆","焜",
    "赦","钰","炯","泂","迦","桧","鳍","只","姬","指","焗","蛰","瑰","噷","狃","舵","陀","怼",
    "伽","沫","溴","敷","绯","窠","鲲","远","稗","峻","氪","迁","钧","剀","噱","倩","铂","骅",
    "劼","苑","或","羞","休","修","先","县","线","仙","含","酷","哭","焊","寒","翰","撼","涵",
    "韩","国","郭","锅","汉","借","阶","截","真","姆","提","目","帧","位","维","为","还","词",
    "刺","此","海","子","仔","字","害","答","搭","达","嗨","谢","鞋","些","咳","珂","课","壳",
    "耗","阁","戈","镉","亥","机","集","鸡","伤","货","蝦","霍","二","而","儿","尔","椁","魏",
    "蝈","威","糁","杰","踢","辞","资","妲","歌","虾","潵","帼","皆","替","韦","玼","姿","笪",
    "斜","科","个","己","蛤","四","七","蟹","可","及","帴","介","题","赐","梓","怛","哥","铪",
    "以","三","五","六","八","九","十","协","克","黑","急","打","幺","哈","红","亦","已","一"];

  // 通过关键字匹配paper icon
  static String? roadPaperIcon({ required String word }) {
    int index = bigRoadCharacterList.indexOf(word);
    if (index == -1) return null;
    return "assets/images/road/roadPaperIcon/${index + 1}.png";
  }

  static List<List<String>> batchRoadPaperIcon({ required List<List<String>> words }) {
    return words.map((row) {
      return row.map((word) {
        return roadPaperIcon(word: word) ?? "";
      }).toList();
    }).toList();
  }
}